/*
Navicat MySQL Data Transfer

Source Server         : ym-mysql
Source Server Version : 50711
Source Host           : localhost:3306
Source Database       : take-out food

Target Server Type    : MYSQL
Target Server Version : 50711
File Encoding         : 65001

Date: 2020-12-23 23:08:24
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `orders`
-- ----------------------------
DROP TABLE IF EXISTS `orders`;
CREATE TABLE `orders` (
  `id` int(30) NOT NULL,
  `ordername` varchar(30) DEFAULT NULL,
  `fid` int(30) DEFAULT NULL,
  `fname` varchar(30) DEFAULT NULL,
  `ordertime` datetime(6) DEFAULT NULL,
  `pid` int(30) DEFAULT NULL,
  `pname` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of orders
-- ----------------------------
INSERT INTO `orders` VALUES ('1', '咖啡', '1', '拉芳舍咖啡馆', '2020-04-10 11:14:56.000000', '1', '李兴亮');
INSERT INTO `orders` VALUES ('2', '肯德基', '2', '肯德基', '2020-04-09 11:18:18.000000', '2', '张宇');
INSERT INTO `orders` VALUES ('3', '肯德基', '2', '肯德基', '2020-04-05 11:19:20.000000', '3', '顾凯峰');
INSERT INTO `orders` VALUES ('4', '肯德基', '2', '肯德基', '2020-04-05 11:20:02.000000', '4', '王珂');
INSERT INTO `orders` VALUES ('5', '鸡排', '47', '买几客鸡排', '2020-04-01 11:22:21.000000', '5', '钱旭强');
INSERT INTO `orders` VALUES ('6', '鸡排', '47', '买几客鸡排', '2020-04-02 11:22:44.000000', '6', '余力');
INSERT INTO `orders` VALUES ('7', '面', '81', '临江小吃', '2020-03-02 11:24:19.000000', '7', '于超');
INSERT INTO `orders` VALUES ('8', '包子', '89', '石师傅包子', '2020-04-24 15:11:35.000000', '8', '冯竹英');
INSERT INTO `orders` VALUES ('9', '咖啡', '3', '上岛咖啡', '2020-04-24 15:42:31.000000', '9', '王威');
INSERT INTO `orders` VALUES ('10', '甜品', '4', '壹期壹会港式甜品', '2020-04-24 15:54:44.000000', '10', '施正栋');
INSERT INTO `orders` VALUES ('11', '蛋糕', '5', 'CC咖啡烘培坊', '2020-04-24 15:57:29.000000', '11', '赵鑫鑫');
INSERT INTO `orders` VALUES ('12', '火锅', '6', '临海新荣记', '2020-04-24 15:59:59.000000', '12', '徐池');
INSERT INTO `orders` VALUES ('13', '餐馆', '7', '江南荣庄', '2020-04-24 16:02:33.000000', '13', '王晗哲');
INSERT INTO `orders` VALUES ('14', '咖啡', '8', '咖语咖啡', '2020-04-24 16:04:48.000000', '2', '张宇');
INSERT INTO `orders` VALUES ('15', '麦虾', '9', '双平麦虾店', '2020-04-24 16:07:09.000000', '14', '吴王哲');
INSERT INTO `orders` VALUES ('16', '小吃', '10', '原子弹小吃', '2020-04-24 16:07:59.000000', '15', '张新磊');
INSERT INTO `orders` VALUES ('17', '咖啡', '11', '临海星巴克', '2020-04-24 16:08:42.000000', '16', '王龙');
INSERT INTO `orders` VALUES ('18', '豆捞', '12', '澳门豆捞(临海店)', '2020-04-24 16:09:30.000000', '17', '赵东亮');
INSERT INTO `orders` VALUES ('19', '咖啡', '13', '旅途咖啡馆', '2020-04-24 16:10:10.000000', '18', '王苗');
INSERT INTO `orders` VALUES ('20', '海鲜', '14', '海鲜码头', '2020-04-24 16:10:56.000000', '19', '钱勇利');
INSERT INTO `orders` VALUES ('21', '麦饼', '15', '老朱麦饼', '2020-04-24 16:51:22.000000', '20', '王芳');
INSERT INTO `orders` VALUES ('22', '中餐', '16', '宜麦香城(鹿城路店)', '2020-04-24 16:57:47.000000', '21', '章兴发');
INSERT INTO `orders` VALUES ('23', '烧饼', '17', '伊之友饼屋台州府路店', '2020-04-24 16:58:56.000000', '22', '李大彪');
INSERT INTO `orders` VALUES ('24', '鸡排', '18', '买几客鸡排', '2020-04-24 16:59:40.000000', '23', '杜德喜');
INSERT INTO `orders` VALUES ('25', '咖啡', '19', '星巢咖啡馆', '2020-04-24 17:00:23.000000', '24', '郭展');
INSERT INTO `orders` VALUES ('26', '龙虾', '20', '忆品香龙虾', '2020-04-24 17:01:06.000000', '25', '陈星星');
INSERT INTO `orders` VALUES ('27', '小吃', '21', '耀达商场小吃店', '2020-04-24 17:01:49.000000', '26', '毛峰');
INSERT INTO `orders` VALUES ('28', '烘培', '22', '新天地烘焙(洪池店)', '2020-04-24 17:02:24.000000', '4', '王珂');
INSERT INTO `orders` VALUES ('29', '麦饼', '23', '周太麦饼', '2020-04-24 17:03:08.000000', '27', '李丽');
INSERT INTO `orders` VALUES ('30', '鱼馆', '24', '丁哥黑鱼馆(崇和路)', '2020-04-24 17:03:44.000000', '28', '王伟龙');
INSERT INTO `orders` VALUES ('31', '咖啡', '25', '古咖主题小馆', '2020-04-25 16:36:29.000000', '6', '余力');
INSERT INTO `orders` VALUES ('32', '小吃', '26', '蒋招娣小吃店', '2020-04-25 16:37:05.000000', '29', '姜星');
INSERT INTO `orders` VALUES ('33', '中餐', '27', '小米餐厅', '2020-04-25 16:37:50.000000', '30', '王胜民');
INSERT INTO `orders` VALUES ('34', '中餐', '28', '靖江春天', '2020-04-25 16:38:35.000000', '31', '杜锋');
INSERT INTO `orders` VALUES ('35', '奶茶', '29', '银泰•绿茶致青春', '2020-04-25 16:39:06.000000', '32', '丁星');
INSERT INTO `orders` VALUES ('36', '烧烤', '30', '两水烧烤', '2020-04-25 16:39:52.000000', '33', '李华');
INSERT INTO `orders` VALUES ('37', '咖啡', '31', '旅途咖啡馆', '2020-04-25 16:40:30.000000', '7', '于超');
INSERT INTO `orders` VALUES ('38', '中餐', '32', '姐妹饮食', '2020-04-25 16:41:10.000000', '34', '李新良');
INSERT INTO `orders` VALUES ('39', '咖啡', '33', 'good coffee', '2020-04-25 16:41:54.000000', '35', '汪苏红');
INSERT INTO `orders` VALUES ('40', '中餐', '34', '麦香村', '2020-04-25 16:42:46.000000', '36', '徐若俊');
INSERT INTO `orders` VALUES ('41', '中餐', '35', '溪口粮站酒家', '2020-04-25 16:37:38.000000', '37', '吴春江');
INSERT INTO `orders` VALUES ('42', '中餐', '36', '两头门饭店', '2020-04-25 16:39:08.000000', '38', '赵亮亮');
INSERT INTO `orders` VALUES ('43', '中餐', '37', '金元渔庄', '2020-04-25 16:39:45.000000', '39', '李新怀');
INSERT INTO `orders` VALUES ('44', '中餐', '38', '金元渔庄', '2020-04-25 16:40:44.000000', '40', '项婷婷');
INSERT INTO `orders` VALUES ('45', '鸡排', '39', '买几客鸡排', '2020-04-25 16:41:45.000000', '41', '李路飞');
INSERT INTO `orders` VALUES ('46', '快餐', '40', '肯德基', '2020-04-25 16:42:22.000000', '42', '吴春路');
INSERT INTO `orders` VALUES ('47', '海鲜', '41', '白沙岛渔家海鲜城', '2020-04-25 16:43:04.000000', '5', '钱旭强');
INSERT INTO `orders` VALUES ('48', '麦虾', '42', '老李记麦虾面', '2020-04-25 16:43:39.000000', '43', '李怀');
INSERT INTO `orders` VALUES ('49', '早餐', '43', '神仙居早餐', '2020-04-25 16:44:29.000000', '44', '王聪聪');
INSERT INTO `orders` VALUES ('50', '烧烤', '44', '火焰山烤蹄', '2020-04-25 16:45:01.000000', '45', '李芳');
INSERT INTO `orders` VALUES ('51', '烤鱼', '45', '朝阳渔港', '2020-04-26 15:24:32.000000', '46', '江浪');
INSERT INTO `orders` VALUES ('52', '中餐', '46', '醉江南风味餐厅', '2020-04-26 15:25:41.000000', '47', '万审维');
INSERT INTO `orders` VALUES ('53', '麻辣烫', '47', '张亮麻辣烫', '2020-04-26 15:26:37.000000', '48', '沈楠');
INSERT INTO `orders` VALUES ('54', '包子', '48', '石师傅包子', '2020-04-26 15:27:27.000000', '49', '丁宇航');
INSERT INTO `orders` VALUES ('55', '茶餐厅', '49', '聚鑫港式茶餐厅 一号店', '2020-04-26 15:28:16.000000', '50', '杨洋');
INSERT INTO `orders` VALUES ('56', '中餐', '50', '随意美食', '2020-04-26 15:30:05.000000', '51', '李立');
INSERT INTO `orders` VALUES ('57', '面条', '51', '舒舒面馆', '2020-04-26 15:30:37.000000', '6', '余力');
INSERT INTO `orders` VALUES ('58', '包子', '52', '长安街包子铺', '2020-04-26 15:31:27.000000', '52', '姜华');
INSERT INTO `orders` VALUES ('59', '烧烤', '53', '长安路大排档', '2020-04-26 15:32:03.000000', '10', '施正栋');
INSERT INTO `orders` VALUES ('60', '麦饼', '54', '灵敏麦饼', '2020-04-26 15:33:32.000000', '51', '王瑞阳');
INSERT INTO `orders` VALUES ('61', '中餐', '55', '江南印象', '2020-04-26 15:16:35.000000', '52', '苏欣欣');
INSERT INTO `orders` VALUES ('62', '鸡排', '56', '买几客鸡排', '2020-04-26 15:17:50.000000', '53', '王明辉');
INSERT INTO `orders` VALUES ('63', '鸡排', '57', '买几客鸡排', '2020-04-26 15:18:42.000000', '54', '费雯');
INSERT INTO `orders` VALUES ('64', '中餐', '58', '江南印象', '2020-04-26 15:20:04.000000', '55', '李阳');
INSERT INTO `orders` VALUES ('65', '肯德基', '59', '肯德基', '2020-04-26 15:21:06.000000', '56', '何雨帆');
INSERT INTO `orders` VALUES ('66', '面条', '60', '大田大排面协会', '2020-04-26 15:21:46.000000', '57', '刘闯');
INSERT INTO `orders` VALUES ('67', '甜品', '61', '甜心炖品屋', '2020-04-26 15:22:32.000000', '58', '王峰');
INSERT INTO `orders` VALUES ('68', '冰淇淋', '62', '优卡冰淇淋', '2020-04-26 15:23:49.000000', '59', '赵小欣');
INSERT INTO `orders` VALUES ('69', '中餐', '63', '彩蝶飞飞', '2020-04-26 15:24:34.000000', '40', '项婷婷');
INSERT INTO `orders` VALUES ('70', '肯德基', '64', '肯德基', '2020-04-26 15:26:21.000000', '60', '罗斌');
INSERT INTO `orders` VALUES ('71', '奶茶', '65', '一点点奶茶', '2020-04-26 14:55:44.000000', '61', '钱旭斌');
INSERT INTO `orders` VALUES ('72', '中餐', '66', 'SWAG', '2020-04-26 14:57:04.000000', '62', '吴慧');
INSERT INTO `orders` VALUES ('73', '麦当劳', '67', '麦当劳 临海服务区店', '2020-04-26 14:57:50.000000', '63', '冯勇');
INSERT INTO `orders` VALUES ('74', '麦虾', '68', '双平麦虾', '2020-04-26 14:58:45.000000', '64', '唐诗');
INSERT INTO `orders` VALUES ('75', '中餐', '69', '鼎峰记', '2020-04-26 14:59:34.000000', '65', '龚小华');
INSERT INTO `orders` VALUES ('76', '粥', '70', '扇耗海鲜粥', '2020-04-26 15:00:38.000000', '66', '郑中天');
INSERT INTO `orders` VALUES ('77', '中餐', '71', '川味观', '2020-04-26 15:01:22.000000', '67', '袁凤');
INSERT INTO `orders` VALUES ('78', '肯德基', '72', '肯德基', '2020-04-26 15:02:31.000000', '68', '李星龙');
INSERT INTO `orders` VALUES ('79', '中餐', '73', '川香味川菜馆', '2020-04-26 15:03:14.000000', '69', '万圣威');
INSERT INTO `orders` VALUES ('80', '面条', '74', '大人面馆', '2020-04-26 15:04:06.000000', '70', '刘书同');
INSERT INTO `orders` VALUES ('81', '面条', '75', '面道', '2020-04-27 15:50:22.000000', '71', '庄严');
INSERT INTO `orders` VALUES ('82', '中餐', '76', '宜麦香城(腊梅店)', '2020-04-27 15:51:11.000000', '72', '刘冲');
INSERT INTO `orders` VALUES ('83', '中餐', '77', '贪嘴鸡煲', '2020-04-27 15:51:54.000000', '73', '张珏');
INSERT INTO `orders` VALUES ('84', '麦虾', '78', '朱记麦虾店', '2020-04-27 15:52:30.000000', '74', '李海');
INSERT INTO `orders` VALUES ('85', '烘培', '79', 'CC烘培', '2020-04-27 15:53:29.000000', '75', '王凤凤');
INSERT INTO `orders` VALUES ('86', '中餐', '80', '红石梁', '2020-04-27 15:54:34.000000', '53', '王明辉');
INSERT INTO `orders` VALUES ('87', '麦当劳', '81', '麦当劳', '2020-04-27 15:55:18.000000', '3', '顾凯峰');
INSERT INTO `orders` VALUES ('88', '牛奶', '82', '一鸣真鲜奶吧(回浦店)', '2020-04-27 15:55:47.000000', '76', '李海兵');
INSERT INTO `orders` VALUES ('89', '奶茶', '83', '果麦de鲜饮创作(广场路店)', '2020-04-27 15:56:37.000000', '77', '王兴亮');
INSERT INTO `orders` VALUES ('90', '面条', '84', '回忆面馆', '2020-04-27 15:59:10.000000', '54', '费雯');
INSERT INTO `orders` VALUES ('91', '麦虾', '85', '李兴麦虾', '2020-04-28 14:36:54.000000', '78', '严玲玲');
INSERT INTO `orders` VALUES ('92', '蛋糕', '86', '元祖(临海店)', '2020-04-28 14:38:03.000000', '79', '施国立');
INSERT INTO `orders` VALUES ('93', '麦虾', '87', '老李麦虾', '2020-04-28 14:38:52.000000', '80', '沈盛');
INSERT INTO `orders` VALUES ('94', '中餐', '88', '小鸣厨房', '2020-04-28 14:39:38.000000', '81', '徐兴芳');
INSERT INTO `orders` VALUES ('95', '中餐', '89', '华必和', '2020-04-28 14:40:32.000000', '82', '张倩倩');
INSERT INTO `orders` VALUES ('96', '中餐', '90', '檀香姜汁扁食', '2020-04-28 14:41:12.000000', '83', '李祖豪');
INSERT INTO `orders` VALUES ('97', '中餐', '91', '紫腾排档', '2020-04-28 14:41:57.000000', '84', '萧芳芳');
INSERT INTO `orders` VALUES ('98', '奶茶', '92', '果麦de鲜饮创作 耀达百货店', '2020-04-28 14:42:47.000000', '85', '杜新华');
INSERT INTO `orders` VALUES ('99', '面条', '93', '一间面铺', '2020-04-28 14:43:25.000000', '86', '曹阳');
INSERT INTO `orders` VALUES ('100', '面包', '94', '新天地烘焙(台州府路店)', '2020-04-28 14:44:02.000000', '2', '张宇');
